Computing/1.3_Computer_Networks_connections_and_protocols.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-16 Mon 11:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1.3 - Computer Networks, connections and protocols</title>
<meta name="author" content="Manas Mengle" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">1.3 - Computer Networks, connections and protocols</h1>

<div id="outline-container-org71cef51" class="outline-2">
<h2 id="org71cef51"><span class="section-number-2">1.</span> 1.3 - Computer Networks, connections and protocols</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org998db1d" class="outline-3">
<h3 id="org998db1d"><span class="section-number-3">1.1.</span> 1.3.1 - Networks and Topologies</h3>
<div class="outline-text-3" id="text-1-1">
<p>
There are two types of network:
</p>
<ul class="org-ul">
<li><b>LAN</b> (Local Area Network)
<ul class="org-ul">
<li>A LAN covers a <i>small geographical area</i> located on a single site.</li>
<li>LANs are either wired (e.g. with <b>Ethernet</b> cables) or wireless (e.g. using <b>WIFI</b>)</li>
</ul></li>
<li><b>WAN</b> (Wide Area Network)
<ul class="org-ul">
<li>A WAN is a network that connects separate LANs over a <i>large geographical area</i>.</li>
<li>This ensures that computers in one location can communicate with computers and users in other locations.</li>
<li>The Internet is an example of a large WAN.</li>
</ul></li>
</ul>
<p>
Certain hardware is needed to connect a computer to a Local Area Network
</p>
<ul class="org-ul">
<li>Wireless Access Points (<b>WAP</b>)
<ul class="org-ul">
<li>Allow wireless devices to connect to a network</li>
<li>Convert data they receive through cables into wireless signals.</li>
<li>Commonly used in public buildings and homes to provide <b>WIFI</b> networks.</li>
</ul></li>
<li>Routers
<ul class="org-ul">
<li>Routers connect different networks together.</li>
<li>They read the address information of the packet they are transferring and forward the messages to the correct network.</li>
<li>They are commonly used to allow many computers to share an Internet connection.</li>
<li>The most common use of this is to connect a home network to a larger one: The Internet.</li>
<li>They can have both cabled and wireless.</li>
</ul></li>
<li>Switches
<ul class="org-ul">
<li>Network switches read the messages that pass through them.</li>
<li>They read the destination address and send them to the intended computer.</li>
<li>They do this by building a table of the device-unique <b>MAC</b> addresses on the network.</li>
</ul></li>
<li>Network Interface Card/Controller (<b>NIC</b>)</li>
<li>Transmission Media
2 main ways:
<ul class="org-ul">
<li>Wired (Cable)
<ul class="org-ul">
<li>Copper cable carries data as electric currents.</li>
<li>Fibre optic carries data as pulses of light.</li>
<li>Data is transmitted according to the Ethernet protocols.</li>
<li>High bandwidth</li>
<li>Expensive</li>
<li>Good security</li>
<li>Low interference</li>
</ul></li>
<li>Microwave/Radio
<ul class="org-ul">
<li>Electromagnetic radiation waves.</li>
<li>Lower bandwidth</li>
<li>Cheaper</li>
<li>Low security</li>
<li>Higher interference</li>
</ul></li>
</ul></li>
</ul>
<p>
Factors that can affect a network&rsquo;s performance
</p>
<ul class="org-ul">
<li>No. of devices</li>
<li>Packet collisions</li>
<li>Bandwidth</li>
<li>Network traffic volume</li>
<li>Network latency</li>
<li>No. of transmission errors</li>
</ul>
<p>
The Internet is based on many technologies:
</p>
<ul class="org-ul">
<li><b>DNS</b> (Domain Name Server)
<b>Domain Names</b> are used to identify IP addresses. They are more convenient to use than remembering IP addresses.
Computers match domain names to IP addresses by sending requests to a Domain Name Server, which then returns the correct IP address for a certain domain.</li>
<li><p>
The Cloud
 The cloud is where large companies will offer services such as storage or computing power.
 <b>No</b> local hardware is required, as all of it is done over the Internet.
 Benefits include being able to access data from anywhere with a reliable Internet connection, and lower cost for hardware. However, cloud services are usually based on a subscription service model, which can introduce higher long term costs.
Pros:
</p>
<ul class="org-ul">
<li>Users can access files from any internet connected device</li>
<li>Storage is easily upgraded</li>
<li>Less expensive hardware required.</li>
<li><i>Security</i> and backups are handled by the host</li>
<li>Automatic updates</li>
</ul>
<p>
Cons:
</p>
<ul class="org-ul">
<li>Need an internet connections</li>
<li>Dependent on a third party for security and backups</li>
<li>Data stored may be vulnerable to hackers.</li>
<li>Subscription fees may be expensive</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org29e725f" class="outline-3">
<h3 id="org29e725f"><span class="section-number-3">1.2.</span> 1.3.2 Wired and wireless networks, connections and protocols</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Networks need <b>protocols</b> to communicate.
</p>
<ul class="org-ul">
<li>A network <b>standard</b> is a set of agreed requirements for both hardware and software.</li>
<li>They allow manufacturers to create compatible products.</li>
<li>A network <b>protocol</b> is a set of <i>rules</i> for how devices communicate and how <b>data is transmitted</b> across a  network.</li>
</ul>
<p>
Communication on the same network use <b>MAC addresses</b>
</p>
<ul class="org-ul">
<li>Every device needs a <b>unique identifier</b> so it can be found on a network.</li>
<li><b>MAC addresses</b> are assigned to every device by a manufacturer. They are unique to the device and <b>cannot be changed</b>.</li>
<li>They are a string of 48 binary numbers, and are commonly converted to hexadecimal, (i.e: <code>10011000 10000001 11001101 11110010 00101111</code> can also be displayed as <code>98-81-55-CD-F2-2F</code>).</li>
<li>MAC addresses are mainly used by the <b>Ethernet protocol</b> on <b>LANs</b>. LAN switches read the MAC addresses and use them to direct data to the right local device.</li>
</ul>
<p>
Communication between different networks use <b>IP addresses</b>
</p>
<ul class="org-ul">
<li><b>IP addresses</b> are used when sending data between <b>TCP/IP</b> networks, such as over the internet.</li>
<li>They are assigned manually, or automatically when a device first connects to a network.</li>
<li>There are two standards, <b>IPv4</b> and <b>IPv6</b>. IPv4 uses <b>32 bits</b>, and IPv6 uses <b>128 bits</b>.</li>
<li>An example of an IPv4 address would be: <code>00100101.10011001.00111110.10001000</code> which would be translated to <b>denary</b> as <code>37.153.62.136</code>.</li>
<li>Most local IPv4 addresses begin <code>11000000.10101000.00000001.00000001</code> which translates to <code>192.168.1.1</code></li>
</ul>
<p>
<b>TCP/IP</b> is the most important protocol.
    It dictates how data is sent between networks. It is made up of two protocols:
</p>
<ul class="org-ul">
<li><b>Transmission Control Protocol</b> (TCP)
<ul class="org-ul">
<li>which sets the rules for how devices connect to networks, and is responsible for <b>splitting data into packets</b> and <b>reassembling the packets back</b> into the original data.</li>
</ul></li>
<li><b>Internet Protocol</b> (IP)
<ul class="org-ul">
<li>which is responsible for <b>directing packets to their destination</b> across a network.</li>
</ul></li>
</ul>
<p>
Several other protocols build upon TCP/IP for specific tasks.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Protocol</th>
<th scope="col" class="org-left">Stands for&#x2026;</th>
<th scope="col" class="org-left">What is it used for?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>HTTP</b></td>
<td class="org-left">Hyper Text Transfer Protocol</td>
<td class="org-left">Used by <b>web browsers</b> to view websites</td>
</tr>

<tr>
<td class="org-left"><b>HTTPS</b></td>
<td class="org-left">HTTP secure</td>
<td class="org-left">A more secure version of HTTP that encrypts information send and received</td>
</tr>

<tr>
<td class="org-left">FTP</td>
<td class="org-left">File transfer protocol</td>
<td class="org-left">Used to access, edit and move files over the internet.</td>
</tr>

<tr>
<td class="org-left">POP3</td>
<td class="org-left">Post office protocol 3</td>
<td class="org-left">Used to <b>Retrieve</b> emails from a server.</td>
</tr>

<tr>
<td class="org-left">IMAP</td>
<td class="org-left">Internet Message Access Protocol</td>
<td class="org-left">Used to <b>Retrieve</b> emails from a server. Used by most web based email clients</td>
</tr>

<tr>
<td class="org-left">SMTP</td>
<td class="org-left">Simple mail Transfer Protocol</td>
<td class="org-left">Used to <b>Send</b> and transfer emails between servers.</td>
</tr>
</tbody>
</table>
<p>
Network Protocols are divided into <b>Layers</b>
</p>
<ul class="org-ul">
<li>A <b>Layer</b> is a group of protocols which have <b>similar functions.</b></li>
<li>They are <b>self-contained</b>, as protocols in each layer <b>are unaffected by changes in other layers</b>.</li>
<li>Data is worked on using a <b>top-down stack</b> of layers.</li>
<li>Advantages:
<ul class="org-ul">
<li>Breaks network into manageable pieces, which helps fix errors.</li>
<li>Layers can be changed or <b>upgraded without other layers being affected</b></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Manas Mengle</p>
<p class="date">Created: 2022-05-16 Mon 11:50</p>
</div>
</body>
</html>
